{
    "Apple___Apple_scab": "Caused by the fungus Venturia inaequalis. It thrives in wet, cool conditions.",
    "Apple___Black_rot": "Caused by the fungus Diplodia seriata. It affects apples in warm, humid weather.",
    "Apple___Cedar_apple_rust": "Caused by the fungus Gymnosporangium juniperi-virginianae. It requires both apple and cedar trees to complete its life cycle.",
    "Apple___healthy": "No disease symptoms present. Regular care helps maintain health.",
    "Blueberry___healthy": "No disease symptoms present. Proper soil and moisture levels are crucial.",
    "Cherry_(including_sour)___Powdery_mildew": "Caused by the fungus Podosphaera clandestina. It thrives in warm, dry conditions.",
    "Cherry_(including_sour)___healthy": "No disease symptoms present.",
    "Corn_(maize)___Cercospora_leaf_spot_Gray_leaf_spot": "Caused by the fungus Cercospora zeae-maydis. It is common in hot, humid conditions.",
    "Corn_(maize)___Common_rust_": "Caused by the fungus Puccinia sorghi. It is prevalent in warm, humid conditions.",
    "Corn_(maize)___Northern_Leaf_Blight": "Caused by the fungus Exserohilum turcicum. It affects corn in cool, wet conditions.",
    "Corn_(maize)___healthy": "No disease symptoms present.",
    "Grape___Black_rot": "Caused by the fungus Guignardia bidwellii. It thrives in warm, humid conditions.",
    "Grape___Esca_(Black_Measles)": "Caused by a complex of fungi, including Phaeoacremonium aleophilum. It leads to vine dieback.",
    "Grape___Leaf_blight_(Isariopsis_Leaf_Spot)": "Caused by the fungus Isariopsis clavispora. It affects grape leaves in humid conditions.",
    "Grape___healthy": "No disease symptoms present.",
    "Orange___Haunglongbing_(Citrus_greening)": "Caused by the bacterium Candidatus Liberibacter asiaticus, transmitted by the Asian citrus psyllid.",
    "Peach___Bacterial_spot": "Caused by the bacterium Xanthomonas campestris. It affects peaches in warm, wet conditions.",
    "Peach___healthy": "No disease symptoms present.",
    "Pepper,_bell___Bacterial_spot": "Caused by the bacterium Xanthomonas campestris. It affects peppers in warm, humid conditions.",
    "Pepper,_bell___healthy": "No disease symptoms present.",
    "Potato___Early_blight": "Caused by the fungus Alternaria solani. It affects potatoes in warm, humid conditions.",
    "Potato___Late_blight": "Caused by the fungus Phytophthora infestans. It thrives in cool, moist conditions.",
    "Potato___healthy": "No disease symptoms present.",
    "Raspberry___healthy": "No disease symptoms present.",
    "Soybean___healthy": "No disease symptoms present.",
    "Squash___Powdery_mildew": "Caused by the fungus Podosphaera xanthii. It thrives in warm, dry conditions.",
    "Strawberry___Leaf_scorch": "Caused by a variety of factors, including heat stress and inadequate watering.",
    "Strawberry___healthy": "No disease symptoms present.",
    "Tomato___Bacterial_spot": "Caused by the bacterium Xanthomonas perforans. It affects tomatoes in warm, wet conditions.",
    "Tomato___Early_blight": "Caused by the fungus Alternaria solani. It affects tomatoes in warm, humid conditions.",
    "Tomato___Late_blight": "Caused by the fungus Phytophthora infestans. It thrives in cool, moist conditions.",
    "Tomato___Leaf_Mold": "Caused by the fungus Passalora fulva. It affects tomatoes in high humidity.",
    "Tomato___Septoria_leaf_spot": "Caused by the fungus Septoria lycopersici. It affects tomatoes in warm, humid conditions.",
    "Tomato___Spider_mites_Two-spotted_spider_mite": "Caused by the Two-spotted spider mite, which thrives in hot, dry conditions.",
    "Tomato___Target_Spot": "Caused by the fungus Corynespora cassiicola. It affects tomatoes in warm, wet conditions.",
    "Tomato___Tomato_Yellow_Leaf_Curl_Virus": "Caused by a virus transmitted by whiteflies. It leads to yellowing and curling of tomato leaves.",
    "Tomato___Tomato_mosaic_virus": "Caused by a virus that leads to mottled, discolored leaves.",
    "Tomato___healthy": "No disease symptoms present."
}
