{
    "Apple___Apple_scab": "Use fungicides containing captan or myclobutanil. Prune affected leaves.",
    "Apple___Black_rot": "Apply copper-based fungicides. Remove and destroy infected fruit.",
    "Apple___Cedar_apple_rust": "Use fungicides containing myclobutanil. Remove nearby cedar trees if possible.",
    "Apple___healthy": "No treatment necessary. Ensure regular care to prevent diseases.",
    "Blueberry___healthy": "No treatment necessary. Maintain proper soil acidity and moisture levels.",
    "Cherry_(including_sour)___Powdery_mildew": "Apply sulfur or potassium bicarbonate. Ensure good air circulation.",
    "Cherry_(including_sour)___healthy": "No treatment necessary. Continue monitoring for potential issues.",
    "Corn_(maize)___Cercospora_leaf_spot Gray_leaf_spot": "Use fungicides containing strobilurins or triazoles.",
    "Corn_(maize)___Common_rust_": "Apply fungicides like azoxystrobin or chlorothalonil. Choose resistant varieties if possible.",
    "Corn_(maize)___Northern_Leaf_Blight": "Use fungicides such as mancozeb or chlorothalonil. Rotate crops to prevent recurrence.",
    "Corn_(maize)___healthy": "No treatment necessary. Continue regular crop rotation and soil management.",
    "Grape___Black_rot": "Use fungicides with active ingredients like myclobutanil or trifloxystrobin.",
    "Grape___Esca_(Black_Measles)": "Prune and destroy affected vines. No effective chemical treatments available.",
    "Grape___Leaf_blight_(Isariopsis_Leaf_Spot)": "Apply fungicides containing copper or mancozeb. Improve vineyard ventilation.",
    "Grape___healthy": "No treatment necessary. Maintain proper vineyard hygiene.",
    "Orange___Haunglongbing_(Citrus_greening)": "There is no cure. Manage with insecticides to control the Asian citrus psyllid.",
    "Peach___Bacterial_spot": "Apply copper-based sprays. Use resistant varieties where available.",
    "Peach___healthy": "No treatment necessary. Ensure regular monitoring and care.",
    "Pepper,_bell___Bacterial_spot": "Use copper-based bactericides. Remove and destroy infected plants.",
    "Pepper,_bell___healthy": "No treatment necessary. Maintain optimal growing conditions.",
    "Potato___Early_blight": "Apply fungicides like chlorothalonil or mancozeb. Ensure proper crop rotation.",
    "Potato___Late_blight": "Use fungicides containing metalaxyl or chlorothalonil. Remove and destroy infected plants.",
    "Potato___healthy": "No treatment necessary. Practice good crop rotation and disease prevention.",
    "Raspberry___healthy": "No treatment necessary. Ensure proper pruning and air circulation.",
    "Soybean___healthy": "No treatment necessary. Practice crop rotation and soil health management.",
    "Squash___Powdery_mildew": "Apply sulfur-based fungicides. Ensure good air circulation around plants.",
    "Strawberry___Leaf_scorch": "Use fungicides containing myclobutanil or azoxystrobin. Remove and destroy infected leaves.",
    "Strawberry___healthy": "No treatment necessary. Maintain good soil and moisture conditions.",
    "Tomato___Bacterial_spot": "Apply copper-based bactericides. Avoid overhead watering.",
    "Tomato___Early_blight": "Use fungicides like chlorothalonil or mancozeb. Ensure good crop rotation practices.",
    "Tomato___Late_blight": "Apply fungicides containing metalaxyl or chlorothalonil. Remove and destroy infected plants.",
    "Tomato___Leaf_Mold": "Use fungicides like chlorothalonil or mancozeb. Improve air circulation around plants.",
    "Tomato___Septoria_leaf_spot": "Apply fungicides such as chlorothalonil or copper-based products. Remove and destroy infected leaves.",
    "Tomato___Spider_mites Two-spotted_spider_mite": "Use miticides or insecticidal soap. Increase humidity around plants.",
    "Tomato___Target_Spot": "Use fungicides containing chlorothalonil or copper. Remove and destroy affected plant parts.",
    "Tomato___Tomato_Yellow_Leaf_Curl_Virus": "No cure; manage with insecticides to control whiteflies.",
    "Tomato___Tomato_mosaic_virus": "No cure; remove and destroy infected plants. Practice good sanitation.",
    "Tomato___healthy": "No treatment necessary. Ensure regular care to prevent diseases."
}